# AdjustComponentPixelPos

## Description
Adjust the pixel width and height of the specified Layout Manager component.

```pascal
FUNCTION AdjustComponentPixelPos(
				nDialogID         : LONGINT;
				nComponentID      : LONGINT;
				nHorizontalPixels : INTEGER;
				nVerticalPixels   : INTEGER) : BOOLEAN;
```

```python

def vs.AdjustComponentPixelPos(nDialogID, nComponentID, nHorizontalPixels, nVerticalPixels):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT||
|nComponentID|LONGINT||
|nHorizontalPixels|INTEGER||
|nVerticalPixels|INTEGER||

## Version
Availability: from VectorWorks 2008
## Category
* Dialogs - Modern